---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroManager.MacroLevel
source: html/fca55ec0-cdcc-739f-edfe-08457134d214.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.MacroLevel Property

The Macro level.

## Syntax (C#)
```csharp
public MacroLevel MacroLevel { get; }
```